
**📖 Terraform planning succeded**

Merge this pull request to apply the plan.

<details><summary>Plan details</summary>

```
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/snout-router/repos/runs/run-u5KiDpBfem4mLQc5

Waiting for the plan to start...

Terraform v1.0.11
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.repo_eslint_config.github_repository.this: Refreshing state... [id=eslint-config]
github_repository.template_repo: Refreshing state... [id=template-repo]
github_repository.dot_github: Refreshing state... [id=.github]
github_repository_file.template_repo_license: Refreshing state... [id=template-repo/LICENSE]
github_repository_file.template_repo_dot_github_workflows_ci_yml: Refreshing state... [id=template-repo/.github/workflows/ci.yml]
github_repository_file.template_repo_dot_github_workflows_publish_release_yml: Refreshing state... [id=template-repo/.github/workflows/publish-release.yml]
github_repository_file.template_repo_dot_github_workflows_ci_scheduled_yml: Refreshing state... [id=template-repo/.github/workflows/ci-scheduled.yml]
github_repository_file.template_repo_dot_github_workflows_ci_pr_size_yml: Refreshing state... [id=template-repo/.github/workflows/ci-pr-size.yml]
github_repository_file.template_repo_dot_github_workflows_publish_website_yml: Refreshing state... [id=template-repo/.github/workflows/publish-website.yml]
github_repository_file.template_repo_dot_github_workflows_publish_package_yml: Refreshing state... [id=template-repo/.github/workflows/publish-package.yml]
github_repository_file.template_repo_dot_github_workflows_ci_website_yml: Refreshing state... [id=template-repo/.github/workflows/ci-website.yml]
module.repo_eslint_config.github_repository_file.dot_github_workflows_publish_release_yml[0]: Refreshing state... [id=eslint-config/.github/workflows/publish-release.yml]
module.repo_eslint_config.github_repository_file.dot_github_workflows_publish_package_yml[0]: Refreshing state... [id=eslint-config/.github/workflows/publish-package.yml]
module.repo_eslint_config.github_repository_file.license: Refreshing state... [id=eslint-config/LICENSE]
github_repository.dot_github_dot_io: Refreshing state... [id=snout-router.github.io]
github_repository_file.dot_github_license: Refreshing state... [id=.github/LICENSE]
module.repo_eslint_config.github_team_repository.dependabot_reviewers: Refreshing state... [id=5195471:eslint-config]
module.repo_router_path.github_repository.this: Refreshing state... [id=router-path]
module.repo_branding.github_repository.this: Refreshing state... [id=branding]
module.repo_jest_config.github_repository.this: Refreshing state... [id=jest-config]
module.repo_tsconfig.github_repository.this: Refreshing state... [id=tsconfig]
module.repo_router_path_extras.github_repository.this: Refreshing state... [id=router-path-extras]
module.repo_regexp.github_repository.this: Refreshing state... [id=regexp]
module.repo_docusaurus_config.github_repository.this: Refreshing state... [id=docusaurus-config]
module.repo_eslint_config_react.github_repository.this: Refreshing state... [id=eslint-config-react]
github_repository_file.dot_github_dot_io_license: Refreshing state... [id=snout-router.github.io/LICENSE]
module.repo_router_path.github_repository_file.dot_github_workflows_publish_release_yml[0]: Refreshing state... [id=router-path/.github/workflows/publish-release.yml]
module.repo_router_path.github_repository_file.license: Refreshing state... [id=router-path/LICENSE]
module.repo_router_path.github_repository_file.dot_github_workflows_publish_package_yml[0]: Refreshing state... [id=router-path/.github/workflows/publish-package.yml]
module.repo_router_path.github_team_repository.dependabot_reviewers: Refreshing state... [id=5195471:router-path]
module.repo_router_path.github_repository_file.dot_github_workflows_ci_scheduled_yml[0]: Refreshing state... [id=router-path/.github/workflows/ci-scheduled.yml]
module.repo_router_path.github_repository_file.dot_github_workflows_ci_yml[0]: Refreshing state... [id=router-path/.github/workflows/ci.yml]
module.repo_router_path.github_repository_file.dot_github_workflows_publish_website_yml[0]: Refreshing state... [id=router-path/.github/workflows/publish-website.yml]
module.repo_router_path.github_repository_file.dot_github_workflows_ci_website_yml[0]: Refreshing state... [id=router-path/.github/workflows/ci-website.yml]
module.repo_router_path.github_repository_file.dot_github_workflows_ci_pr_size_yml[0]: Refreshing state... [id=router-path/.github/workflows/ci-pr-size.yml]
module.repo_branding.github_team_repository.dependabot_reviewers: Refreshing state... [id=5195471:branding]
module.repo_branding.github_repository_file.license: Refreshing state... [id=branding/LICENSE]
module.repo_branding.github_repository_file.dot_github_workflows_publish_package_yml[0]: Refreshing state... [id=branding/.github/workflows/publish-package.yml]
module.repo_branding.github_repository_file.dot_github_workflows_publish_release_yml[0]: Refreshing state... [id=branding/.github/workflows/publish-release.yml]
module.repo_jest_config.github_repository_file.dot_github_workflows_publish_release_yml[0]: Refreshing state... [id=jest-config/.github/workflows/publish-release.yml]
module.repo_jest_config.github_repository_file.dot_github_workflows_publish_package_yml[0]: Refreshing state... [id=jest-config/.github/workflows/publish-package.yml]
module.repo_jest_config.github_repository_file.license: Refreshing state... [id=jest-config/LICENSE]
module.repo_jest_config.github_team_repository.dependabot_reviewers: Refreshing state... [id=5195471:jest-config]
module.repo_tsconfig.github_team_repository.dependabot_reviewers: Refreshing state... [id=5195471:tsconfig]
module.repo_tsconfig.github_repository_file.dot_github_workflows_publish_package_yml[0]: Refreshing state... [id=tsconfig/.github/workflows/publish-package.yml]
module.repo_tsconfig.github_repository_file.dot_github_workflows_publish_release_yml[0]: Refreshing state... [id=tsconfig/.github/workflows/publish-release.yml]
module.repo_tsconfig.github_repository_file.license: Refreshing state... [id=tsconfig/LICENSE]
module.repo_router_path_extras.github_repository_file.dot_github_workflows_ci_pr_size_yml[0]: Refreshing state... [id=router-path-extras/.github/workflows/ci-pr-size.yml]
module.repo_router_path_extras.github_repository_file.dot_github_workflows_ci_scheduled_yml[0]: Refreshing state... [id=router-path-extras/.github/workflows/ci-scheduled.yml]
module.repo_router_path_extras.github_repository_file.dot_github_workflows_ci_yml[0]: Refreshing state... [id=router-path-extras/.github/workflows/ci.yml]
module.repo_router_path_extras.github_repository_file.dot_github_workflows_publish_release_yml[0]: Refreshing state... [id=router-path-extras/.github/workflows/publish-release.yml]
module.repo_router_path_extras.github_team_repository.dependabot_reviewers: Refreshing state... [id=5195471:router-path-extras]
module.repo_router_path_extras.github_repository_file.license: Refreshing state... [id=router-path-extras/LICENSE]
module.repo_router_path_extras.github_repository_file.dot_github_workflows_publish_package_yml[0]: Refreshing state... [id=router-path-extras/.github/workflows/publish-package.yml]
module.repo_regexp.github_team_repository.dependabot_reviewers: Refreshing state... [id=5195471:regexp]
module.repo_regexp.github_repository_file.dot_github_workflows_publish_package_yml[0]: Refreshing state... [id=regexp/.github/workflows/publish-package.yml]
module.repo_regexp.github_repository_file.dot_github_workflows_ci_website_yml[0]: Refreshing state... [id=regexp/.github/workflows/ci-website.yml]
module.repo_regexp.github_repository_file.license: Refreshing state... [id=regexp/LICENSE]
module.repo_regexp.github_repository_file.dot_github_workflows_publish_release_yml[0]: Refreshing state... [id=regexp/.github/workflows/publish-release.yml]
module.repo_regexp.github_repository_file.dot_github_workflows_ci_scheduled_yml[0]: Refreshing state... [id=regexp/.github/workflows/ci-scheduled.yml]
module.repo_regexp.github_repository_file.dot_github_workflows_ci_yml[0]: Refreshing state... [id=regexp/.github/workflows/ci.yml]
module.repo_regexp.github_repository_file.dot_github_workflows_ci_pr_size_yml[0]: Refreshing state... [id=regexp/.github/workflows/ci-pr-size.yml]
module.repo_regexp.github_repository_file.dot_github_workflows_publish_website_yml[0]: Refreshing state... [id=regexp/.github/workflows/publish-website.yml]
module.repo_docusaurus_config.github_team_repository.dependabot_reviewers: Refreshing state... [id=5195471:docusaurus-config]
module.repo_docusaurus_config.github_repository_file.license: Refreshing state... [id=docusaurus-config/LICENSE]
module.repo_docusaurus_config.github_repository_file.dot_github_workflows_publish_package_yml[0]: Refreshing state... [id=docusaurus-config/.github/workflows/publish-package.yml]
module.repo_docusaurus_config.github_repository_file.dot_github_workflows_publish_release_yml[0]: Refreshing state... [id=docusaurus-config/.github/workflows/publish-release.yml]
module.repo_eslint_config_react.github_team_repository.dependabot_reviewers: Refreshing state... [id=5195471:eslint-config-react]
module.repo_eslint_config_react.github_repository_file.dot_github_workflows_publish_package_yml[0]: Refreshing state... [id=eslint-config-react/.github/workflows/publish-package.yml]
module.repo_eslint_config_react.github_repository_file.dot_github_workflows_publish_release_yml[0]: Refreshing state... [id=eslint-config-react/.github/workflows/publish-release.yml]
module.repo_eslint_config_react.github_repository_file.license: Refreshing state... [id=eslint-config-react/LICENSE]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.repo_eslint_config.github_team_repository.dependabot_reviewers has been changed
  ~ resource "github_team_repository" "dependabot_reviewers" {
      ~ etag       = "W/\"e283143c72baa3f1202abacb8716a69c12cbe89afa99c3d24b99a25ea44ca93d\"" -> "W/\"ff4300f2fb0d8a7fa57dde5f1ecf73fdcf3840d60e08832e8480aa1af1d71c5c\""
        id         = "5195471:eslint-config"
        # (3 unchanged attributes hidden)
    }
  # module.repo_router_path_extras.github_team_repository.dependabot_reviewers has been changed
  ~ resource "github_team_repository" "dependabot_reviewers" {
      ~ etag       = "W/\"3d4964390dfcbaa273f75424aaf62294b3e463766178ee6fb63dd098e78169ad\"" -> "W/\"ce43ebaee1ec61f24c30d52ead4b6eeef4468025bdaf7c081c55b9afe382f0bd\""
        id         = "5195471:router-path-extras"
        # (3 unchanged attributes hidden)
    }
  # module.repo_jest_config.github_team_repository.dependabot_reviewers has been changed
  ~ resource "github_team_repository" "dependabot_reviewers" {
      ~ etag       = "W/\"89091af6a8437ea36408742f8a4d8864a3b1d2446e1044a8f8d170c837c82328\"" -> "W/\"f90a7928b4157ea5fc890d7a717315b6a0f5d9381fa9c3cce8c80a08701b80a2\""
        id         = "5195471:jest-config"
        # (3 unchanged attributes hidden)
    }
  # module.repo_branding.github_team_repository.dependabot_reviewers has been changed
  ~ resource "github_team_repository" "dependabot_reviewers" {
      ~ etag       = "W/\"6373025145614eb0179346b128bc6e77963f7cd1d45ec2453cae279a44b4dfd1\"" -> "W/\"ac8a35a2d2f3cfb857bf99659be6e137bc10a4e51ffb16ed179e0c6c24cf4048\""
        id         = "5195471:branding"
        # (3 unchanged attributes hidden)
    }
  # module.repo_router_path.github_team_repository.dependabot_reviewers has been changed
  ~ resource "github_team_repository" "dependabot_reviewers" {
      ~ etag       = "W/\"aefe8e550974b030d824088b1117d0f921ae51686d34b8436e2499f71aa0d14a\"" -> "W/\"56d468dd5c8771487da3db4a6cea0218a791478c4f048326f642cdc31f64c557\""
        id         = "5195471:router-path"
        # (3 unchanged attributes hidden)
    }
  # module.repo_docusaurus_config.github_team_repository.dependabot_reviewers has been changed
  ~ resource "github_team_repository" "dependabot_reviewers" {
      ~ etag       = "W/\"3e2635f6923cea89985686df3c3f89648fb9f9d5e4d07b732fadd688db82d452\"" -> "W/\"7b3cf132c24a997a9b91549e0a35af1880d47ce9cd5232cf3ad96650d487b600\""
        id         = "5195471:docusaurus-config"
        # (3 unchanged attributes hidden)
    }
  # module.repo_eslint_config_react.github_team_repository.dependabot_reviewers has been changed
  ~ resource "github_team_repository" "dependabot_reviewers" {
      ~ etag       = "W/\"ab3365d267be88c5ec52f3dfe35d210d7a489f659480014b21cf457d327d9086\"" -> "W/\"f17c4cd4bf25dbca1c33d96cb945f71d2da3c6d6e6bfac05965ba3a3cba5c799\""
        id         = "5195471:eslint-config-react"
        # (3 unchanged attributes hidden)
    }
  # module.repo_regexp.github_team_repository.dependabot_reviewers has been changed
  ~ resource "github_team_repository" "dependabot_reviewers" {
      ~ etag       = "W/\"6f40f6eaa0e251df4a8541cc252062d96e1a2454789b4cf305740fce6bcf814b\"" -> "W/\"f9e14f9dee6d56541ca48df9df1fb2b251cdd48d918986b6d7ff51eb77ab0565\""
        id         = "5195471:regexp"
        # (3 unchanged attributes hidden)
    }
  # module.repo_tsconfig.github_team_repository.dependabot_reviewers has been changed
  ~ resource "github_team_repository" "dependabot_reviewers" {
      ~ etag       = "W/\"79ef106eb3d5ff8bd1a2b7b24ee916d4ebc91c272b4736a1af7f5cbc947cc0b9\"" -> "W/\"da858b7b0211d1825b8f01cdf8cbb56eb7cd67699597f7fc0ca5591f2149f0b6\""
        id         = "5195471:tsconfig"
        # (3 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.repo_test_repo_b.github_repository.this will be created
  + resource "github_repository" "this" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archive_on_destroy     = true
      + archived               = false
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "A repo for testing Terraform repo management"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_projects           = false
      + has_wiki               = false
      + homepage_url           = "https://snout.dev"
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "test-repo-b"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = true

      + template {
          + owner      = "snout-router"
          + repository = "template-repo"
        }
    }

  # module.repo_test_repo_b.github_repository_file.dot_github_workflows_publish_package_yml[0] will be created
  + resource "github_repository_file" "dot_github_workflows_publish_package_yml" {
      + branch              = (known after apply)
      + commit_author       = "snout-router-repo-manager[bot]"
      + commit_email        = "97502368+snout-router-repo-manager[bot]@users.noreply.github.com"
      + commit_message      = "Update \"Publish package\" GHA workflow"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            name: Publish package
            on:
              push:
                tags:
                - '[0-9]+.[0-9]+.[0-9]+'
            jobs:
              publish:
                name: Snout
                uses: snout-router/.github/.github/workflows/publish-package.yml@main
                secrets:
                  NPM_TOKEN: ${{ secrets.NPM_TOKEN }}
        EOT
      + file                = ".github/workflows/publish-package.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "test-repo-b"
      + sha                 = (known after apply)
    }

  # module.repo_test_repo_b.github_repository_file.dot_github_workflows_publish_release_yml[0] will be created
  + resource "github_repository_file" "dot_github_workflows_publish_release_yml" {
      + branch              = (known after apply)
      + commit_author       = "snout-router-repo-manager[bot]"
      + commit_email        = "97502368+snout-router-repo-manager[bot]@users.noreply.github.com"
      + commit_message      = "Update \"Publish release\" GHA workflow"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            name: Publish release
            on:
              push:
                tags:
                - '*'
            jobs:
              publish:
                name: Snout
                uses: snout-router/.github/.github/workflows/publish-release.yml@main
        EOT
      + file                = ".github/workflows/publish-release.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "test-repo-b"
      + sha                 = (known after apply)
    }

  # module.repo_test_repo_b.github_repository_file.license will be created
  + resource "github_repository_file" "license" {
      + branch              = (known after apply)
      + commit_author       = "snout-router-repo-manager[bot]"
      + commit_email        = "97502368+snout-router-repo-manager[bot]@users.noreply.github.com"
      + commit_message      = "Update license"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            Copyright © 2021 Erin Millard
            
            Permission is hereby granted, free of charge, to any person obtaining a copy
            of this software and associated documentation files (the "Software"), to deal
            in the Software without restriction, including without limitation the rights
            to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
            copies of the Software, and to permit persons to whom the Software is
            furnished to do so, subject to the following conditions:
            
            The above copyright notice and this permission notice shall be included in
            all copies or substantial portions of the Software.
            
            THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
            IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
            FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
            AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
            LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
            OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
            THE SOFTWARE.
        EOT
      + file                = "LICENSE"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "test-repo-b"
      + sha                 = (known after apply)
    }

  # module.repo_test_repo_b.github_team_repository.dependabot_reviewers will be created
  + resource "github_team_repository" "dependabot_reviewers" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "test-repo-b"
      + team_id    = "5195471"
    }

Plan: 5 to add, 0 to change, 0 to destroy.


```

</details>